import time
def play_award_sound():
    try:
        import winsound

        notes = {
            "до": 523,
            "ре": 587,
            "ми": 659,
            "фа": 698,
            "ля": 440,
            "си": 494,
        }

        melody = [
            ("ре", 180), ("ми", 180), ("ре", 180),
            ("фа", 450),
            ("фа", 160), ("фа", 160), ("фа", 160), ("фа", 160), ("фа", 160),
            ("ми", 420), ("си", 550)]
        melody1 = [
            ("ми", 180), ("ре", 180), ("до", 180),
            ("ми", 450),
            ("ми", 160), ("ми", 160), ("ми", 160), ("ми", 260), ("ми", 260)]
        melody2 = [
            ("ре", 520), ("ми", 550),
            ("ре", 180), ("ми", 180), ("ре", 180),
            ("фа", 450),
            ("фа", 260), ("фа", 260), ("фа", 260), ("фа", 260), ("фа", 260)]
        melody3=[
            ("ми", 320), ("си", 550), ("ми", 220),
            ("ре", 220), ("до", 220), ("ля", 650)]
        
        for note, duration in (melody+melody1+melody2+melody3) :
            winsound.Beep(notes[note], duration)
            time.sleep(0.05)


    except ImportError:
        print("К сожалению, звуковые эффекты не поддерживаются на этой платформе. Но ты не попал в хит-парад моих мыслей! Не присылай больше мне свои письма..")
    finally:
        print("Ты не попал в хит-парад моих мыслей! Не присылай больше мне свои письма..Ты не попал или это твой выстрел, Был не тому?.. ")